
## Plan Result (stg)




<pre><code>Plan: 4 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.azure-clientID
  * azurerm_key_vault_secret.azure-clientSecret
  * azurerm_key_vault_secret.azure-tenantID
  * module.postgresql.terraform_data.trigger_password_reset
* Move
  * module.application_insights.azurerm_monitor_activity_log_alert.main => module.application_insights.azurerm_monitor_activity_log_alert.main[0]
  * module.application_insights_pdm.azurerm_monitor_activity_log_alert.main => module.application_insights_pdm.azurerm_monitor_activity_log_alert.main[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.azure-clientID will be created
  + resource "azurerm_key_vault_secret" "azure-clientID" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pdda-stg/providers/Microsoft.KeyVault/vaults/pdda-stg"
      + name                    = "public-display-data-aggregator-authentication-clientID"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.azure-clientSecret will be created
  + resource "azurerm_key_vault_secret" "azure-clientSecret" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pdda-stg/providers/Microsoft.KeyVault/vaults/pdda-stg"
      + name                    = "public-display-data-aggregator-authentication-clientSecret"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.azure-tenantID will be created
  + resource "azurerm_key_vault_secret" "azure-tenantID" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pdda-stg/providers/Microsoft.KeyVault/vaults/pdda-stg"
      + name                    = "public-display-data-aggregator-authentication-tenantID"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.application_insights.azurerm_monitor_activity_log_alert.main has moved to module.application_insights.azurerm_monitor_activity_log_alert.main[0]
    resource "azurerm_monitor_activity_log_alert" "main" {
        id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pdda-stg/providers/Microsoft.Insights/activityLogAlerts/Application Insights daily cap reached - pdda-stg"
        name                = "Application Insights daily cap reached - pdda-stg"
        tags                = {
            "application"         = "public-display-data-aggregator"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pdda-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#pdda"
            "environment"         = "staging"
            "managedBy"           = "PDDA"
        }
        # (5 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.application_insights_pdm.azurerm_monitor_activity_log_alert.main has moved to module.application_insights_pdm.azurerm_monitor_activity_log_alert.main[0]
    resource "azurerm_monitor_activity_log_alert" "main" {
        id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pdda-stg/providers/Microsoft.Insights/activityLogAlerts/Application Insights daily cap reached - pdm-stg"
        name                = "Application Insights daily cap reached - pdm-stg"
        tags                = {
            "application"         = "public-display-data-aggregator"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pdda-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#pdda"
            "environment"         = "staging"
            "managedBy"           = "PDDA"
        }
        # (5 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.postgresql.terraform_data.trigger_password_reset will be created
  + resource "terraform_data" "trigger_password_reset" {
      + id     = (known after apply)
      + input  = ""
      + output = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":84,"Program":"tfcmt","SHA1":"","Target":"stg","Vars":{}} -->